Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་དེ་ཆེར་སྐྱེས་པ་དང་དེའི་མིང་མི་སྡུག་པ་ཞེས་བཏགས་སོ། །
en: They named him Virūpa (Ugly), and as soon as he was grown,

source: དེ་ནས་དེ་ཁྱིམ་ནས་བསྐྲད་དེ་བཏང་ནས།
en: they threw him out of the house.

source: དེ་བཀྲེས་ཤིང་སྐོམ་པས་ལུས་རིད་པར་གྱུར་ནས་འཁར་བ་དང་སྣོད་ཐོགས་ཏ་སློང་བ་ལ་ཞུགས་སོ། །
en: Emaciated from hunger and thirst, he began to beg, carrying around a walking stick and a pot.

source: དེ་ནས་དེ་གང་གི་ཁྱིམ་སྒོའམ་ཟོང་བཞག་པའི་སའམ་ཚོང་ཁང་དུ་འོངས་པ་དེར་གྲོང་མིའི་བྱིས་པ་རྣམས་ཀྱིས་དེ་ལ་ཁུ་ཚུར་དང་ཐལ་ལྕག་དང་དབྱིག་པ་དང་བོང་བ་རྣམས་ཀྱིས་བརྡེགས་ཏེ། འདྲེ་འོངས་སོ་ཞེས་ཟེར་ཞིང་སྐྲོད་པར་བྱེད་དོ། །
en: Whenever he came to the door of a house, or to someplace where goods were kept, or to a shop, the people of the village would punch him, cuff him, pelt him with sticks and dirt clods, shout “Here comes a ghost!” and chase him away.

source: དེ་ནས་དེ་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེས་ཏེ།
en: He suffered greatly and wondered,

source: བདག་གིས་ལས་མི་དགེ་བ་ཅི་ཞིག་བྱས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་བདག་གིས་སྡུག་བསྔལ་འདི་ལྟ་བུ་མྱོང་བར་གྱུར་ཞིག་གུ།
en: “What nonvirtuous act did I commit that has ripened into such suffering for me now?

source: བདག་གྲོང་ཁྱེར་ན་གནས་པ་བཏང་ལ་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ། སྐྱེད་མོས་ཚལ་དེ་དང་དེ་དག་ཏུ་སོང་ལ་སློངས་མོ་བྱས་ཀྱང་
en: Let me give up living in the city and leave to go begging from garden to garden.

source: དེར་བདག་གིས་ལྟོ་གང་ཙམ་རྙེད་གྲང་སྙམ་ནས་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ།
en: I shall find something to fill my stomach there.” With this thought he set out from the city.

source: སྐྱེད་མོས་ཚལ་དེ་དང་དེ་དག་ཏུ་རྒྱུ་བ་ལ་ཞུགས་ནས། དེར་ཡང་དེ་ལ་འདྲེ་ཡིན་ནོ་སྙམ་ནས་
en: As he began making his way from garden to garden, the people there also thought he was a ghost.

source: དེ་དག་གིས་ཁུ་ཚུར་དང་ཐལ་ལྕག་དང་དབྱུག་པ་དང་བོང་བ་རྣམས་ཀྱིས་བརྡེགས་ནས་སྐྲོད་པར་བྱེད་དོ། །
en: They punched him, cuffed him, pelted him with sticks and dirt clods, and chased him away.

source: དེ་ནས་དེ་བརྡེགས་པས་འཇིགས་ཤིང་སྐྲག་ལ་མིས་འཇིགས་ཤིང་སྐྲག་ནས། ཚང་ཚིང་དག་གི་ནང་དུ་ཞུགས་ཏེ་ཉིན་མོ་ཟད་པར་བྱེད་ལ།
en: Finally, terrified of being beaten and terrified of people, he went into the thick of the forest and spent his days there,

source: ཉི་མ་ནུབ་པའི་འོག་ཏུ་སྐྱེད་མོས་ཚལ་དེ་དང་དེ་དག་ཏུ་སོང་ནས་དེ་དག་ཏུ་ཁ་ཟས་བྲུལ་བ་གང་ཡིན་པ་དེ་དག་ཙམ་གྱིས་འཚོ་བར་བྱེད་དོ། །
en: walking after sundown from garden to garden, nourishing himself only with whatever food fell to the ground.

source: སྲིད་པ་ཐ་མ་པའི་སེམས་ཅན་བར་མ་དོར་འཆི་བ་ནི་གནས་མེད་ཅིང་སྐབས་མེད་དོ། །
en: Now it is impossible and out of the question for a being in their final existence to die an untimely death.

source: དེས་དེར་སྲོག་ཟུངས་ཅུང་ཟད་ཙམ་དག་རྙེད་དོ། །
en: Thus, he found just enough to stay alive there.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ་མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ་ཉིན་མཚན་དུས་དྲུག་ཏུ། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་རྒུད་སུ་ནི་དར་སུ་ནི་ཕོངས་ཤིང་འདུག་སུ་ནི་ཉམ་ང་བར་གྱུར་སུ་ནི་གནོད་པ་དང་ལྡན་སུ་ནི་ཕོངས་པ་དང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན་སུ་ནི་ངན་སོང་དུ་གཞོལ་སུ་ནི་ངན་སོང་དུ་འབབ་སུ་ནི་ངན་སོང་དུ་བབ་སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེམཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: “Who is in decline? Who will flourish? Who is destitute? Who is in a dreadful state? Who is being harmed? Who is destitute, in a dreadful state, and being harmed? Who is veering toward the lower realms? Who is descending through the lower realms? Who has descended to the lower realms? Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: སུ་ནི་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བ་ལས་ལ་གནས་དྲང་བར་བྱ།
en: Whom, mired in misdeeds, shall I lift up by the hand?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་མི་སྡུག་པ་གདུལ་བའི་དུས་ལ་བབ་པར་དགོངས་ནས་འགོག་པའི་སྙོམས་པར་ཞུགས་ཏེ།
en: The Blessed One knew that the time had come to tame young Virūpa, and entered into meditative absorption in cessation.

source: འགོག་པའི་སྙོམས་པར་ཞུགས་པ་ལས་བཞེངས་ནས། དེ་ཁོ་ན་གདུལ་བའི་ཕྱིར་སངས་རྒྱས་ཉིད་དེ་བས་ཀྱང་ཆེས་མི་སྡུག་པ་ཞིག་ཏུ་སྤྲུལ་ཏེ།
en: Then the Buddha rose from his meditative absorption in cessation just to tame young Virūpa, emanating a form with features even uglier than his.

source: བཟའ་བ་དང་བཅའ་བས་གྱོ་མོ་བཀང་ནས་ས་ཕྱོགས་གང་ན་ཁྱེའུ་མི་སྡུག་པ་འདུག་པའི་ས་ཕྱོགས་དེར་གཤེགས་སོ། །
en: Then, after filling a vessel with food and drink, he set out to see young Virūpa.

source: དེ་ནས་ཁྱེའུ་མི་སྡུག་པས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: When young Virūpa saw the Blessed One in the distance

source: མཐོང་ནས་ཀྱང་བྲོས་ཏེ་འདི་ཡང་འོངས་པ་དང་བདག་ལ་རྡེག་ཏུ་འོང་ངོ་སྙམ་མོ། །
en: he fled, thinking, “This person is coming to beat me!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་དེ་འབྲོས་མི་ནུས་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །
en: But the Blessed One performed a miracle of preventing the young man from fleeing.

source: དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ལྟ་འདོད་པར་གྱུར་ཏེ།
en: The Buddha’s miracle also caused Virūpa to wish to see the Blessed One.

source: འདི་ལྟ་བུ་སུ་ཡིན་པ་དེ་རེ་ཞིག་བལྟའོ་སྙམ་ནས་ཕྱིར་ལོག་སྟེ།
en: “I would like to know who that is,” he thought, and came walking back.

source: ཁྱེའུ་མི་སྡུག་པས་སྤྲུལ་པ་མཆོག་ཏུ་མི་སྡུག་པ་དེ་མཐོང་ནས་མཐོང་མ་ཐག་ཏུ་དེའི་བློ་སྐྱེས་པ། འདི་ཁོ་ན་འདྲ་བ་ཁྱོད་སུ་ཞིག་ཅེས་དྲིའོ་སྙམ་ནས་
en: As soon as young Virūpa saw the emanation’s extraordinarily ugly features he began to wonder, “Who could this be?”

source: སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་དེ་ག་ལ་བ་དེར་སོང་བ་དང་སངས་རྒྱས་ཀྱི་སྤྲུལ་པས་ཁྱེའུ་མི་སྡུག་པ་མཐོང་ནསའབྲོས་པ་ལྟར་བྱས་པ་དང་
en: so he went to where the Buddha’s emanation stood. The Buddha’s emanation saw young Virūpa, and made as if to run away.

source: ཁྱེའུ་མི་སྡུག་པ་དེས་སྨྲས་པ། གྲོགས་པོ་ཁྱོད་ཀྱིས་བདག་མཐོང་ན་
en: Young Virūpa called to him, “You’ve already seen me, friend.

source: ཅི་ཕྱིར་འབྲོས་སངས་རྒྱས་ཀྱི་སྤྲུལ་པས་སྨྲས་པ།
en: Why are you running away?”

source: གྲོགས་པོ་བདག་ནི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ལུས་འདི་ལྟ་བུར་གྱུར་ཏེ
en: The Buddha’s emanation replied, “By the ripening of my past actions, my friend, my form has become like this.

source: ཁྱོད་ཀྱིས་བདག་ལ་འདྲེ་ཡིན་ནོ་སྙམ་སྟེ་བརྡེགས་སུ་དོགས་ནས་བདག་གིས་ཁྱོད་མཐོང་ནས་འབྲོས་སོ། །
en: I was afraid you might beat me, thinking that I am a ghost, so I ran.”

source: ཁྱེའུ་མི་སྡུག་པས་སྨྲས་པ། གྲོགས་པོ་བདག་ཀྱང་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་འདི་ལྟར་མི་སྡུག་པར་གྱུར་ཏེ།
en: “It was likewise by the ripening of actions of my past lives that I gained these unattractive features, my friend,” said young Virūpa

source: བདག་མི་སྡུག་པའི་ཕྱིར་ཕ་མས་ཁྱིམ་ནས་བསྐྲད་དེ།
en: “Because of my unattractive features my parents threw me out of the house.

source: བདག་སློངས་མོ་ལ་གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེར་ཁུ་ཚུར་དང་ཐལ་ལྕག་དང་དབྱིག་པ་དང་བོང་བ་དག་གིས་བརྡེགས་ཤིང་བསྐྲད་དེ།
en: As I went wherever I could for alms, I was punched, cuffed, and pelted with sticks and dirt clods, and chased away,

source: བདག་མིས་བརྡེགས་པས་འཇིགས་ཤིང་སྐྲག་ནས་ཚང་ཚིང་འདིའི་ནང་དུ་ཞུགས་ཏེ་འདུག་གིས་ཁྱོད་ཀྱང་ཚུར་ཤོག་དང་ལྷན་ཅིག་འགྲོགས་ཏེ་རྒྱུ་བར་བྱའོ། །
en: until I lived in terror of being beaten and chased away. In terror of being beaten by people, I went into the thick of the forest, and there I have stayed—that is, until you came along. Let’s be friends and make our way together.”

source: དེ་ནས་སྤྲུལ་པ་དེས་དེ་ལྟར་བྱའོ་ཞེས་སྨྲས་ནས། དེ་ཉིད་དུ་འདུག་སྟེ་དེས་དེ་ལ་ཁ་ཟས་ཀྱི་བགོ་བཤའ་བྱས་ནས།
en: “Let’s do that,” the emanation said, and he sat down there and divided his food with Virūpa.

source: དེ་ཟོས་ཏེ་འགྲངས་ཤིང་ངོམས་ལ་དབང་པོ་བརྟས་ནས་སྤྲུལ་པ་དེ་ལ་སེམས་དགའ་བར་གྱུར་པ་དང་།
en: After they had filled their bellies with food and drink until they were quite content, young Virūpa felt joy toward the emanation.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་སྡུག་པའི་གཟུགས་མི་སྣང་བར་མཛད་དེ། རང་བཞིན་གྱི་སྐུ་བསྟན་ནས་
en: Then the Blessed One made his own unattractive features disappear and assumed his natural form.

source: ཁྱེའུ་མི་སྡུག་པས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ་མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ།
en: Young Virūpa beheld the Blessed One. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels.

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས་དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཇི་འདྲ་བ་དེ་ལྟ་བུ་ནི། ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་ཏེ
en: When young Virūpa saw the Blessed Buddha the sight of him filled him with supreme joy, for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not experienced even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་དགའ་བར་གྱུར་ཏེ། དེ་དགའ་བར་གྱུར་ནས་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Thus seeing the Blessed One, he felt a surge of joy toward him, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་ཁྱེའུ་མི་སྡུག་པ་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་
en: and manifested the resultant state of non-return right where he sat.

source: གལ་ཏེ་བདག་གིས་ལུས་འདི་ལྟ་བུར་མ་གྱུར་དུ་ཟིན་ན་བདག་ཀྱང་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་ཞིང་ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བྱ་བ་དང་སྦྱོར་བ་རྣམས་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའི་ཕྱིར་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པར་བྱ་བ་ཞིག་སྙམ་མོ། །
en: “If my body weren’t like this, I too would go forth in the doctrine of the Blessed One, in order to ford the floodwaters and completely escape my fetters with diligence, practice, and effort.”

source: དེ་ནས་རབ་ཏུ་འབྱུང་བའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཁྱེའུ་དེའི་མི་སྡུག་པ་མེད་པར་གྱུར་ནས་བྱད་གཟུགས་བཟང་པོར་གྱུར་ཏེ། ཁ་དོག་རྒྱས་པ་མཆོག་དང་ལྡན་པར་གྱུར་ཏོ། །
en: No sooner did he wish to go forth than his unattractive features disappeared and he became well proportioned and handsome, endowed with the finest of complexions.

source: དེ་ནས་དེ་ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་དགའ་བར་གྱུར་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He felt another surge of joy toward the Blessed One, rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and made this request of the Blessed One:

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monk!” the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་མི་སྡུག་པས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ།
en: “Lord,” the monks asked the Blessed One, “what action did young Virūpa take that ripened into his birth into a family of great means, prosperity, and wealth;

source: མི་སྡུག་པའི་སྣ་གྲངས་བཅྭ་བརྒྱད་དང་ལྡན་པར་གྱུར་ནས
en: that his appearance had eighteen unattractive features,

source: འདི་མི་སྡུག་པའི་ཕྱིར་ཕ་མ་གཉིས་ཀྱིས་ཁྱིམ་ནས་བསྐྲད་ལ།
en: and that because of his unattractive features he was cast from the house by his parents;

source: རབ་ཏུ་བྱུང་བའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེའི་མི་སྡུག་པ་མ་མཆིས་པར་གྱུར་ཏེ། བྱད་གཟུགས་བཟང་པོར་གྱུར་ནས་
en: that as soon as he felt a sense of renunciation, the unattractive features went away and he had a fine face and form;

source: འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཤིང་། མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེདགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་མི་སྡུག་པ་ཉིད་ཀྱིས་ལས་དེ་ལྟ་བུ་བྱས་ཤིང་བསགས་ཏེ་
en: “Monks,” the Blessed One explained, “such are the actions that Virūpa committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རི་ཁྲོད་ཀྱི་གྲོང་ཞིག་ན། ཁྱིམ་བདག་སེར་སྣ་ཅན་འཇུངས་པ་ཡོ་བྱད་ཀུན་དུ་འཛིན་པ་ཞིག་གནས་པ་ལས་ཕྱི་ཞིག་ན་དེ་ཁྱིམ་ན་འདུག་པ་དང་།
en: “Monks, in times gone by, in a certain mountain village there lived a miserly, avaricious householder who hoarded all his belongings.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མི་བཞུགས་པའི་ཚེ། རང་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་སྟེ
en: This was during a time when blessed buddhas were not in the world, and so solitary buddhas had arisen.

source: རང་སངས་རྒྱས་ཤིག་ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་བསོད་སྙོམས་ལ་འོངས་ནས།
en: One day when he was at home, a solitary buddha came to the householder’s home for alms.

source: ཁྱིམ་བདག་དེས་དེ་ལ་བསོད་སྙོམས་ཕུལ་བ་ལས་བསོད་སྙོམས་ཕུལ་བའི་འོག་ཏུ་འགྱོད་པ་སྐྱེས་ཏེ།
en: The householder gave alms to him and then regretted having given him alms.

source: བདག་གིས་ཟས་འདི་དགེ་སྦྱོང་མགོ་རེག་ལས་མེད་པ་འདི་ལ་བྱིན་པ་བས་ནི་ཚལ་ཟའམ་ལས་བྱེད་པ་ལ་བྱིན་དང་རུང་བ་ཞིག་སྙམ་སྟེ།
en: “ ‘Better to eat the vegetables myself or to give them to someone who works than to give them to this monk who’s got only a shaved head to show for himself!”

source: དེ་འགྱོད་པར་གྱུར་པས་ཁ་ཟས་དེ་ཕྱིར་ཕྲོགས་ནས་ལུས་དང་ངག་གི་ལས་ཚུལ་མི་སྡུག་པ་ཐོ་བཙམས་ཏེ་ཁྱིམ་ནས་བསྐྲད་དོ། །
en: Now regretful, he stole back the food, and chased the sage away from the house, cruelly intending to physically and verbally abuse him.

source: དེ་ནས་རང་སངས་རྒྱས་དེས་བསམས་པ་ཉོན་མོངས་པ་འདི་ནི་དམས་ཤིང་ཉམས་པར་གྱུར་ཏེ། གཏན་དུ་དམས་པར་གྱུར་ན་མི་རུང་གིས་འདིའི་ར་མདའ་བྱ་དགོས་སོ་སྙམ་ནས་
en: “The solitary buddha thought, ‘It’s not right for this emotionally afflicted person, who has become so abased, to continue in this downward spiral. I have to help him.’

source: སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ཏེ། འབར་བ་དང་ལམ་མེར་འདུག་པ་དང་ཆར་པ་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ཏོ། །
en: So he rose up into the sky, making a miraculous display of fire and light, rain and lightning.

source: སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་རྫུ་འཕྲུལ་གྱིས་མྱུར་དུ་དད་པར་བྱེད་དེ།
en: “Ordinary people are quickly brought to faith through miracles,

source: དེ་ཤིང་ལྗོན་པ་སོག་ལེས་བཅད་པ་བཞིན་དུ་ཞབས་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: so when he saw all this, the householder bowed down at the sage’s feet like a tree felled by a saw and said,

source: སྐལ་བ་ཆེན་པོ་དང་ལྡན་པ་མར་གཤེགས།
en: ‘O great fortunate one, please come down!

source: བདག་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བའི་ལག་ནས་དྲང་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: I’m mired in misdeeds! Please reach down and lift me up!’

source: རང་སངས་རྒྱས་དེ་ཡང་དེ་ཁོ་ན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར། ས་ལ་བབས་ནས་
en: Solely out of compassion for him, the solitary buddha descended.

source: དེས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། བཟོད་པ་གསོལ་ནས། ཡང་བསོད་སྙོམས་ཕུལ་ཏེ་སྨོན་ལམ་བཏབ་པ།
en: “The householder bowed down at his feet, asked his forgiveness, gave him alms, and prayed,

source: འདི་ལྟར་བདག་གིས་ཡོན་གནས་འདི་ལྟ་བུ་ལ་གནོད་པ་བྱས་པའི་ལས་འདིའི་སྐལ་བ་ཅན་དུ་བདག་མ་གྱུར་ཅིག །
en: ‘May no portion of the act of harming this person so worthy of offerings ripen to me.

source: འདི་ལྟར་བདག་གིས་ཕྱིར་ཡང་བཀུར་སྟི་བྱས་པའི་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: By the root of virtue of having thus venerated him again, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: གལ་ཏེ་སྡིག་པའི་ལས་འདིའི་འབྲས་བུ་གདོན་མི་ཟ་བར་བདག་ལ་སྨིན་པར་གྱུར་ན་ཡང་རབ་ཏུ་འབྱུང་བའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བདག་གི་མི་སྡུག་པ་མེད་པར་གྱུར་ཏེ་བྱད་གཟུགས་བཟང་པོར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Should it be the case that this nonvirtue must certainly bear fruit, then as soon as I feel a sense of renunciation, may my unattractive features disappear and may I become well proportioned and handsome.’

source: དེའི་ཚེ་ཁྱིམ་བདག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་མི་སྡུག་པ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that householder then is none other than Virūpa.

source: དེས་དེར་རང་སངས་རྒྱས་ལ་བསོད་སྙོམས་ཕུལ་བའི་འོག་ཏུ་ཕྱིར་ཕྲོགས་ཏེ་ལུས་དང་ངག་གི་ལས་ཚུལ་མི་སྡུག་པས་ཐོ་བཙམས་ནས། ཁྱིམ་ནས་བསྐྲད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་མི་སྡུག་པར་གྱུར་ཏེ་ཁྱིམ་ནས་བསྐྲད་དོ། །
en: The acts of giving alms to the solitary buddha, then stealing them back and chasing him away from the house, cruelly intending to physically and verbally abuse him, ripened such that wherever he was born, he had unattractive features and was cast out of the house.

source: དེས་རང་སངས་རྒྱས་ལ་ཕྱིར་ཡང་བསོད་སྙོམས་ཕུལ་ནས་སྨོན་ལམ་བཏབ་སྟེ།
en: The act of giving alms to the solitary buddha again and praying,

source: གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: ‘Wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: ཡོན་ཏན་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་པར་གྱུར་ཅིག་ཅེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: May I achieve such great virtues,’ ripened such that wherever he was born it was into a family of great means, prosperity, and wealth.

source: དགེ་སློང་དག་ང་རང་སངས་རྒྱས་བྱེ་བ་ཕྲག་འབུམ་བས་ཀྱང་ཆེས་ལྷག་པར་ཁྱད་པར་དུ་འཕགས་པ་ང་ལྟ་བུ་འདིས་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ།
en: “Monks, I am more exalted than even one hundred billion solitary buddhas, and now he has pleased me, not displeased me,

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་འདི་རབ་ཏུ་བྱུང་ནས།
en: “He also went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དེས་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: Then, having practiced pure conduct all his life, at the time of his death he prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While I may not have attained any great virtues, still I have gone forth like this in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: and manifested arhatship.”

source: བདེ་བྱེད་ཅེས་བྱ་བ་ནི།
en: The Story of Kṣemaṅkara

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་རྒྱལ་པོ་གསལ་རྒྱལ་རྒྱལ་པོ་བྱེད་དོ། །
en: When the Blessed One was in Śrāvastī, King Prasenajit reigned in the city of Śrāvastī,

source: གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ནི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ་དེ་གཉིས་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་ནས་དུས་དུས་སུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: and King Brahmadatta reigned in Vārāṇasī. The two did not agree with one another, and at various times a great many people were killed.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་སྟེ། གླང་པོ་ཆེའི་ཚོགས་དང་རྟའི་ཚོགས་དང་ཤིང་རྟའི་ཚོགས་དང་དཔུང་བུ་ཆུང་གི་ཚོགས་རྣམས་གོ་བསྐོན་ནས། གཡུལ་འགྱེད་པའི་ཕྱིར་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ཐོག་ཏུ་དྲངས་ཏེ། ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་ཕྲུ་མ་བཏབ་སྟེ་འདུག་གོ། །
en: One day King Brahmadatta arrayed the four divisions of his army—the elephant division, the horse division, the chariot division, and the infantry division—and advanced on the kingdom of King Prasenajit to wage war. King Brahmadatta made camp and stayed on the banks of the Ajiravatī River.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཡུལ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། གཡུལ་འགྱེད་པའི་ཕྱིར་བདག་གི་ཐོག་ཏུ་དྲངས་ཏེ། དེས་ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་ཕྲུ་མ་བཏབ་སྟེ་འདུག་གོ་ཞེས་ཐོས་ནས།
en: King Prasenajit heard that Brahmadatta , King of Kāśi, had arrayed the four divisions of his army to wage war, had made camp, and was staying on the banks of the Ajiravatī River,

source: ཐོས་མ་ཐག་ཏུ་དེས་ཀྱང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། གཡུལ་འགྱེད་པའི་ཕྱིར་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་སྟེང་དུ་དྲངས་ཏེ། དེས་ཀྱང་ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་ཕྲུ་མ་བཏབ་སྟེ་འདུག་ནས།
en: so he also arrayed the four divisions of his army and advanced toward King Brahmadatta to wage war and made camp, staying on the banks of the Ajiravatī River.

source: དེ་གཉིས་དེ་ན་འདུག་ཅིང་དུས་དུས་སུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དེ།
en: Over time, many people were slaughtered as the two groups camped there.

source: དེ་གཉི་ག་ཡང་མཐུ་ཆེ་བས་གཅིག་གིས་གཅིག་མི་ཐུབ་སྟེ། དེ་གཉིས་དེར་ཡུན་རིང་མོ་ཞིག་ལོན་ནོ། །
en: Both sides were powerful, and neither could defeat the other.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་ན་དེ་འཁོད་བཞིན་དུ་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་བཙུན་མོ་ལ་བུ་ཆགས་པར་གྱུར་ནས།
en: Time passed, and one day while they were camped there King Brahmadatta ’s queen conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ། དེ་བཙས་མ་ཐག་ཏུ་ཕོ་བྲང་འཁོར་དེར་ཀུན་དགའ་བའི་རོལ་མོའི་སྒྲ་བསྒྲགས་སོ། །
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, and as soon as she was born, celebratory music resounded from the palace.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་སོ་ཞེས་ཐོས་ནས།
en: King Prasenajit heard that a daughter had been born to King Brahmadatta who was well proportioned, pleasing to the eye, and beautiful.

source: ཐོས་མ་ཐག་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: As soon as he heard this, his spirits lifted, and he thought,

source: ཚངས་པས་བྱིན་དང་གཉེན་དུ་བྱས་པའི་ཐབས་བདག་གིས་རྙེད་དོ། །
en: “I’ve found a way to become King Brahmadatta ’s kin.

source: བུ་མོ་དེ་ལ་བརྟེན་ཏེ་འདི་དང་བདག་འཁོན་མེད་པར་བྱའོ་སྙམ་བསམས་ནས།
en: Because of this little child there will be no more resentment between us.”

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: King Prasenajit sent an envoy to King Brahmadatta with the following message:

source: གྲོགས་པོ་འཁོན་མེད་པར་བྱའོ། །
en: “Let there be no more resentment, my friend.

source: བུ་མོ་འདི་ལས་བརྟེན་ཏེ་བདག་ཅག་འཁོན་མེད་པར་བྱ་ཡིས།
en: Because of your daughter there will be no more resentment.

source: བུ་མོ་འོ་ནི་བདག་གི་ཆུང་མར་བྱིན་ཅིག་ཅེས་བྱས་སོ། །
en: Hand your daughter to me in marriage.”

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དེ་ཐོས་མ་ཐག་ཏུ་དགའ་བར་གྱུར་ཏེ་བསམས་པ།
en: As soon as King Brahmadatta heard this, his spirits lifted too and he thought,

source: འདི་དང་བདག་གིས་དུས་དུས་སུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་ཀྱིས་བུ་མོ་དེ་ལ་བརྟེན་ཏེའདི་དང་འཁོན་མེད་པར་བྱའོ་སྙམ་བསམས་ནས།
en: “Over time he and I have both slaughtered many people. But because of my daughter there will be no more resentment between us.”

source: དེས་ཀྱང་དེ་ལ་ཕོ་ཉའི་ལན་བཏང་སྟེ། ཁྱོད་ཇི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བྱའོ་ཞེས་བྱས་ནས།
en: He sent an envoy with his response: “As you wish.”
